Revit 2026 API

# RebarConstrainedHandleGetEdgeNumber Method

---

If the RebarConstrainedHandle's RebarHandleType is 'Edge', then this function will return the number of the edge that is driven by the handle.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int GetEdgeNumber()
```
```vb
Public Function GetEdgeNumber As Integer
```
```cpp
public:
int GetEdgeNumber()
```
```fsharp
member GetEdgeNumber : unit -> int
```

#### Return Value

Int32

| Exception | Condition |
| --- | --- |
| InvalidOperationException | RebarConstrainedHandle is no longer valid. -or- The RebarConstrainedHandle is not of RebarHandleType 'Edge'. |

#### Reference

RebarConstrainedHandle Class

Autodesk.Revit.DB.Structure Namespace